Управление_по_целям_и_KPI/src/Documents/KPI_ВводОценокСтандартов/KPI_ВводОценокСтандартов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ВводОценокСтандартов</name>
  <basedOn>Document.KPI_Планирование</basedOn>
  <registerRecords>AccumulationRegister.KPI_Факты</registerRecords>
  <attributes>
    <name>АвторДокументаСотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокументаСтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оценки</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.KPI_Планирование</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.KPI_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесСтандарта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесОтветственного</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Колво</name>
      <comment>Количество одинаковых пар (стандарт и оцениваемый)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_Стандарты/KPI_Стандарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_Стандарты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оцениваемый</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </resources>
  <resources>
    <name>ВесСтандарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесОтветственного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.KPI_Стандарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.KPI_ВводОценокСтандартов</types>
      <types>DocumentRef.KPI_Планирование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_Планирование/KPI_Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_Планирование</name>
  <registerRecords>AccumulationRegister.KPI_Планы</registerRecords>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.KPI_МоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСмартЗадач</name>
    <type>
      <types>EnumRef.KPI_ВидыРасчетаСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеФильтраАналитик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючАналитики</name>
      <type>
        <types>CatalogRef.KPI_КлючиАналитики</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОтветственные</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесСтандарта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_ВводОценокСтандартов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Проведен Тогда
		Ответ = Вопрос("Перед заполнением необходимо распровести документ, выполнить отмену проведения ?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		Иначе
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда 
		Сообщить("Не введена дата документа");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодичностьПланирования) Тогда 
		Сообщить("Не введена периодичность планирования");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СтруктураКомпании) Тогда 
		Сообщить("Не введен объект управления");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	БезОценок.Основание,
	|	БезОценок.ДатаОценки КАК ДатаОценки,
	|	БезОценок.Стандарт,
	|	БезОценок.ВесСтандарта,
	|	БезОценок.ВесОтветственного,
	|	Одинаковые.Колво
	|ИЗ
	|	(ВЫБРАТЬ
	|		Планирование.Основание КАК Основание,
	|		Планирование.ДатаОценки КАК ДатаОценки,
	|		Планирование.Стандарт КАК Стандарт,
	|		Планирование.Оцениваемый КАК Оцениваемый,
	|		Планирование.ВесСтандарта КАК ВесСтандарта,
	|		Планирование.ВесОтветственного КАК ВесОтветственного
	|	ИЗ
	|		(ВЫБРАТЬ
	|			KPI_Стандарты.Основание КАК Основание,
	|			KPI_Стандарты.ДатаОценки КАК ДатаОценки,
	|			KPI_Стандарты.Стандарт КАК Стандарт,
	|			KPI_Стандарты.Оцениваемый КАК Оцениваемый,
	|			KPI_Стандарты.ВесСтандарта КАК ВесСтандарта,
	|			KPI_Стандарты.ВесОтветственного КАК ВесОтветственного
	|		ИЗ
	|			РегистрСведений.KPI_Стандарты КАК KPI_Стандарты
	|		ГДЕ
	|			KPI_Стандарты.Основание ССЫЛКА Документ.KPI_Планирование) КАК Планирование
	|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				KPI_Стандарты.Основание КАК Основание,
	|				KPI_Стандарты.ДатаОценки КАК ДатаОценки,
	|				KPI_Стандарты.Стандарт КАК Стандарт,
	|				KPI_Стандарты.Оцениваемый КАК Оцениваемый,
	|				KPI_Стандарты.ВесСтандарта КАК ВесСтандарта,
	|				KPI_Стандарты.ВесОтветственного КАК ВесОтветственного
	|			ИЗ
	|				РегистрСведений.KPI_Стандарты КАК KPI_Стандарты
	|			ГДЕ
	|				KPI_Стандарты.Основание ССЫЛКА Документ.KPI_ВводОценокСтандартов) КАК ВводОценокСтандартов
	|			ПО Планирование.ДатаОценки = ВводОценокСтандартов.ДатаОценки
	|				И Планирование.Стандарт = ВводОценокСтандартов.Стандарт
	|				И Планирование.Оцениваемый = ВводОценокСтандартов.Оцениваемый
	|	ГДЕ
	|		ВводОценокСтандартов.Основание ЕСТЬ NULL ) КАК БезОценок
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			KPI_Стандарты.Стандарт КАК Стандарт,
	|			KPI_Стандарты.Оцениваемый КАК Оцениваемый,
	|			КОЛИЧЕСТВО(KPI_Стандарты.ДатаОценки) КАК Колво
	|		ИЗ
	|			РегистрСведений.KPI_Стандарты КАК KPI_Стандарты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			KPI_Стандарты.Стандарт,
	|			KPI_Стандарты.Оцениваемый) КАК Одинаковые
	|		ПО БезОценок.Оцениваемый = Одинаковые.Оцениваемый
	|			И БезОценок.Стандарт = Одинаковые.Стандарт
	|ГДЕ
	|	БезОценок.ДатаОценки >= &НачалоПериода
	|	И БезОценок.ДатаОценки <= &КонецПериода
	|	И БезОценок.Оцениваемый = &Оцениваемый"
	;
	
	
	СтруктураГраницПериода = Новый Структура;
	СтруктураГраницПериода = KPI_ОбщегоНазначенияСервер.ГраницыПериода(Объект.Дата, Объект.ПериодичностьПланирования);	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураГраницПериода.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", СтруктураГраницПериода.КонецПериода);
	Запрос.УстановитьПараметр("Оцениваемый", Объект.СтруктураКомпании);
	
	Объект.Оценки.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКомпанииПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , Объект.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		Объект.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
		СтруктураКомпанииПредставление = ОбъектУправления.СтруктураКомпанииПредставление;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКомпанииПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	Объект.СтруктураКомпании = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.СтруктураКомпании) Тогда
		Сообщить("Перед изменением даты необходимо очистить поле ""Объект управления""");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Оценки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Объект.Оценки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураКомпанииПредставлениеПриИзменении(Элемент)
	Объект.Оценки.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредставления()
	СтруктураКомпанииПредставление = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Объект.СтруктураКомпании, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьПредставления();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьПредставления();
КонецПроцедуры
